# vstNumPts

## Description
```pascal
PROCEDURE vstNumPts(VAR outNumPts : LONGINT);
```

```python

def vs.vstNumPts():
    return outNumPts
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outNumPts|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events